

Процедура ОсновныеДействияФормыПечатьВсех(Кнопка)
	ПечатьДокумента(Новый Массив);
	Закрыть();
КонецПроцедуры

Процедура ОсновныеДействияФормыПечать(Кнопка)
	
	ТекСтроки = ЭлементыФормы.ТПСотрудники.ВыделенныеСтроки;
	
	МасСотрудники = Новый Массив;
	
	Если ТекСтроки.Количество() > 0 Тогда
		Для каждого Строка Из ТекСтроки Цикл
			МасСотрудники.Добавить(Строка.Сотрудник);
		КонецЦикла; 
	КонецЕсли; 
	
	ПечатьДокумента(МасСотрудники);
	
	Закрыть();
КонецПроцедуры

Процедура ПриОткрытии()
	
	Для каждого Строка Из СсылкаНаОбъект.РаботникиОрганизации Цикл
		
		Если ТПСотрудники.Найти(Строка.Сотрудник, "Сотрудник") = Неопределено Тогда
			НоваяСтрока = ТПСотрудники.Добавить();
			НоваяСтрока.Сотрудник = Строка.Сотрудник;
		КонецЕсли; 
		
	КонецЦикла; 
	
	ТПСотрудники.Сортировать("Сотрудник");
	
КонецПроцедуры
